typedef char *hkStringPtr;
typedef unsigned long long uint64;
typedef int int32;
typedef unsigned int uint32;
typedef unsigned short uint16;
typedef short int16;
typedef char int8;
typedef unsigned char uint8;
typedef float hkReal;
typedef unsigned int hkFlags;
typedef unsigned short hkHalf;

struct hkVariant
{
    void *m_object;
    hkClass *m_class;
};

struct hkVector4
{
    float x, y, z, w;
};

struct hkMatrix3
{
    hkVector4 col0; // 00
    hkVector4 col1; // 10
    hkVector4 col2; // 20
};

struct hkMatrix4
{
    hkVector4 col0;
    hkVector4 col1;
    hkVector4 col2;
    hkVector4 col3;
};

struct hkMatrix3x4
{
    float cr[3][4];
};


struct hkRotation : hkMatrix3
{
};

struct hkQuaternion
{
    hkVector4 vec;
};

struct hkTransform
{
    hkMatrix3x4 rotation;
	hkVector4	translation;
};

struct hkQsTransform
{
    hkVector4		translation;
	hkQuaternion	rotation;
	hkVector4		scale;
};

template <typename T>
class hkArrayBase
{
public:
    T *data;
    int32 size;
    int32 capacityAndFlags;
};

template <typename T, typename Allocator = void>
class hkArray : public hkArrayBase<T>
{
};

template <typename T, int N, typename Allocator = void>
class hkInplaceArray : public hkArray<T, Allocator>
{
public:
    T storage[N];
};

class hkBaseObject
{
public:
    virtual ~hkBaseObject();
};
class hkLocalFrameGroup : public hkReferencedObject
{
public:
    virtual ~hkLocalFrameGroup();
    hkStringPtr name;
};
class hkReferencedObject : public hkBaseObject
{
public:
    virtual ~hkReferencedObject();
    uint16 memSizeAndFlags;
    int16 referenceCount;
};
class hkSimpleLocalFrame : public hkLocalFrame
{
public:
    virtual ~hkSimpleLocalFrame();
    hkTransform transform;
    hkArray<hkLocalFrame *> children;
    struct hkLocalFramehkLocalFrame *parentFrame;
    struct hkLocalFrameGrouphkLocalFrameGroup *group;
    hkStringPtr name;
};
class hkTrackerSerializableScanSnapshot : public hkReferencedObject
{
public:
    virtual ~hkTrackerSerializableScanSnapshot();
    hkArray<struct hkTrackerSerializableScanSnapshotAllocation> allocations;
    hkArray<struct hkTrackerSerializableScanSnapshotBlock> blocks;
    hkArray<int32> refs;
    hkArray<uint8> typeNames;
    hkArray<uint8> traceText;
    hkArray<uint64> traceAddrs;
    hkArray<int32> traceParents;
};
class hkMonitorStreamColorTable : public hkReferencedObject
{
public:
    virtual ~hkMonitorStreamColorTable();
    hkArray<struct hkMonitorStreamColorTableColorPair> colorPairs;
    uint32 defaultColor;
};
class hkMemoryResourceContainer : public hkResourceContainer
{
public:
    virtual ~hkMemoryResourceContainer();
    hkStringPtr name;
    struct hkMemoryResourceContainerhkMemoryResourceContainer *parent;
    hkArray<hkMemoryResourceHandle *> resourceHandles;
    hkArray<hkMemoryResourceContainer *> children;
};
class hkMemoryResourceHandle : public hkResourceHandle
{
public:
    virtual ~hkMemoryResourceHandle();
    struct hkReferencedObjecthkReferencedObject *variant;
    hkStringPtr name;
    hkArray<struct hkMemoryResourceHandleExternalLink> references;
};
class hkAlignSceneToNodeOptions : public hkReferencedObject
{
public:
    virtual ~hkAlignSceneToNodeOptions();
    bool invert;
    bool transformPositionX;
    bool transformPositionY;
    bool transformPositionZ;
    bool transformRotation;
    bool transformScale;
    bool transformSkew;
    int32 keyframe;
    hkStringPtr nodeName;
};
class hkxAnimatedFloat : public hkReferencedObject
{
public:
    virtual ~hkxAnimatedFloat();
    hkArray<float> floats;
    uint8 hint;
};
class hkxAnimatedMatrix : public hkReferencedObject
{
public:
    virtual ~hkxAnimatedMatrix();
    hkArray<hkMatrix4> matrices;
    uint8 hint;
};
class hkxAnimatedQuaternion : public hkReferencedObject
{
public:
    virtual ~hkxAnimatedQuaternion();
    hkArray<hkQuaternion> quaternions;
};
class hkxAnimatedVector : public hkReferencedObject
{
public:
    virtual ~hkxAnimatedVector();
    hkArray<hkVector4> vectors;
    uint8 hint;
};
class hkxAttributeHolder : public hkReferencedObject
{
public:
    virtual ~hkxAttributeHolder();
    hkArray<struct hkxAttributeGroup> attributeGroups;
};
class hkxCamera : public hkReferencedObject
{
public:
    virtual ~hkxCamera();
    hkVector4 from;
    hkVector4 focus;
    hkVector4 up;
    float fov;
    float far;
    float near;
    bool leftHanded;
};
class hkxEdgeSelectionChannel : public hkReferencedObject
{
public:
    virtual ~hkxEdgeSelectionChannel();
    hkArray<int32> selectedEdges;
};
class hkxEnum : public hkReferencedObject
{
public:
    virtual ~hkxEnum();
    hkArray<struct hkxEnumItem> items;
};
class hkxEnvironment : public hkReferencedObject
{
public:
    virtual ~hkxEnvironment();
    hkArray<struct hkxEnvironmentVariable> variables;
};
class hkxIndexBuffer : public hkReferencedObject
{
public:
    virtual ~hkxIndexBuffer();
    int8 indexType;
    hkArray<uint16> indices16;
    hkArray<uint32> indices32;
    uint32 vertexBaseOffset;
    uint32 length;
};
class hkxLight : public hkReferencedObject
{
public:
    virtual ~hkxLight();
    int8 type;
    hkVector4 position;
    hkVector4 direction;
    uint32 color;
    float angle;
};
class hkxMaterial : public hkxAttributeHolder
{
public:
    virtual ~hkxMaterial();
    hkStringPtr name;
    hkArray<struct hkxMaterialTextureStage> stages;
    hkVector4 diffuseColor;
    hkVector4 ambientColor;
    hkVector4 specularColor;
    hkVector4 emissiveColor;
    hkArray<hkxMaterial *> subMaterials;
    struct hkReferencedObjecthkReferencedObject *extraData;
    hkArray<struct hkxMaterialProperty> properties;
};
class hkxMaterialEffect : public hkReferencedObject
{
public:
    virtual ~hkxMaterialEffect();
    hkStringPtr name;
    uint8 type;
    hkArray<uint8> data;
};
class hkxMaterialShader : public hkReferencedObject
{
public:
    virtual ~hkxMaterialShader();
    hkStringPtr name;
    uint8 type;
    hkStringPtr vertexEntryName;
    hkStringPtr geomEntryName;
    hkStringPtr pixelEntryName;
    hkArray<uint8> data;
};
class hkxMaterialShaderSet : public hkReferencedObject
{
public:
    virtual ~hkxMaterialShaderSet();
    hkArray<hkxMaterialShader *> shaders;
};
class hkxMesh : public hkReferencedObject
{
public:
    virtual ~hkxMesh();
    hkArray<hkxMeshSection *> sections;
    hkArray<hkxMeshUserChannelInfo *> userChannelInfos;
};
class hkxMeshSection : public hkReferencedObject
{
public:
    virtual ~hkxMeshSection();
    struct hkxVertexBufferhkxVertexBuffer *vertexBuffer;
    hkArray<hkxIndexBuffer *> indexBuffers;
    struct hkxMaterialhkxMaterial *material;
    hkArray<hkReferencedObject *> userChannels;
};
class hkxMeshUserChannelInfo : public hkxAttributeHolder
{
public:
    virtual ~hkxMeshUserChannelInfo();
    hkStringPtr name;
    hkStringPtr className;
};
class hkxNode : public hkxAttributeHolder
{
public:
    virtual ~hkxNode();
    hkStringPtr name;
    struct hkReferencedObjecthkReferencedObject *object;
    hkArray<hkMatrix4> keyFrames;
    hkArray<hkxNode *> children;
    hkArray<struct hkxNodeAnnotationData> annotations;
    hkStringPtr userProperties;
    bool selected;
};
class hkxNodeSelectionSet : public hkxAttributeHolder
{
public:
    virtual ~hkxNodeSelectionSet();
    hkArray<hkxNode *> selectedNodes;
    hkStringPtr name;
};
class hkxScene : public hkReferencedObject
{
public:
    virtual ~hkxScene();
    hkStringPtr modeller;
    hkStringPtr asset;
    float sceneLength;
    struct hkxNodehkxNode *rootNode;
    hkArray<hkxNodeSelectionSet *> selectionSets;
    hkArray<hkxCamera *> cameras;
    hkArray<hkxLight *> lights;
    hkArray<hkxMesh *> meshes;
    hkArray<hkxMaterial *> materials;
    hkArray<hkxTextureInplace *> inplaceTextures;
    hkArray<hkxTextureFile *> externalTextures;
    hkArray<hkxSkinBinding *> skinBindings;
    hkMatrix3 appliedTransform;
};
class hkxSkinBinding : public hkReferencedObject
{
public:
    virtual ~hkxSkinBinding();
    struct hkxMeshhkxMesh *mesh;
    hkArray<hkStringPtr> nodeNames;
    hkArray<hkMatrix4> bindPose;
    hkMatrix4 initSkinTransform;
};
class hkxSparselyAnimatedBool : public hkReferencedObject
{
public:
    virtual ~hkxSparselyAnimatedBool();
    hkArray<bool> bools;
    hkArray<float> times;
};

class hkxSparselyAnimatedInt : public hkReferencedObject
{
public:
    virtual ~hkxSparselyAnimatedInt();
    hkArray<int32> ints;
    hkArray<float> times;
};
class hkxSparselyAnimatedString : public hkReferencedObject
{
public:
    virtual ~hkxSparselyAnimatedString();
    hkArray<hkStringPtr> strings;
    hkArray<float> times;
};
class hkxTextureFile : public hkReferencedObject
{
public:
    virtual ~hkxTextureFile();
    hkStringPtr filename;
    hkStringPtr name;
    hkStringPtr originalFilename;
};
class hkxTextureInplace : public hkReferencedObject
{
public:
    virtual ~hkxTextureInplace();
    char fileType;
    hkArray<uint8> data;
    hkStringPtr name;
    hkStringPtr originalFilename;
};
class hkxTriangleSelectionChannel : public hkReferencedObject
{
public:
    virtual ~hkxTriangleSelectionChannel();
    hkArray<int32> selectedTriangles;
};
class hkxVertexBuffer : public hkReferencedObject
{
public:
    virtual ~hkxVertexBuffer();
    struct hkxVertexBufferVertexData data;
    struct hkxVertexDescription desc;
};
class hkxVertexFloatDataChannel : public hkReferencedObject
{
public:
    virtual ~hkxVertexFloatDataChannel();
    hkArray<float> perVertexFloats;
    uint8 dimensions;
};
class hkxVertexIntDataChannel : public hkReferencedObject
{
public:
    virtual ~hkxVertexIntDataChannel();
    hkArray<int32> perVertexInts;
};
class hkxVertexSelectionChannel : public hkReferencedObject
{
public:
    virtual ~hkxVertexSelectionChannel();
    hkArray<int32> selectedVertices;
};
class hkxVertexVectorDataChannel : public hkReferencedObject
{
public:
    virtual ~hkxVertexVectorDataChannel();
    hkArray<hkVector4> perVertexVectors;
};
class hkIndexedTransformSet : public hkReferencedObject
{
public:
    virtual ~hkIndexedTransformSet();
    hkArray<hkMatrix4> matrices;
    hkArray<hkMatrix4> inverseMatrices;
    hkArray<int16> matricesOrder;
    hkArray<hkStringPtr> matricesNames;
    hkArray<struct hkMeshBoneIndexMapping> indexMappings;
    bool allMatricesAreAffine;
};
class hkMemoryMeshBody : public hkMeshBody
{
public:
    virtual ~hkMemoryMeshBody();
    hkMatrix4 transform;
    struct hkIndexedTransformSethkIndexedTransformSet *transformSet;
    struct hkMeshShapehkMeshShape *shape;
    hkArray<hkMeshVertexBuffer *> vertexBuffers;
    hkStringPtr name;
};
class hkMemoryMeshMaterial : public hkMeshMaterial
{
public:
    virtual ~hkMemoryMeshMaterial();
    hkStringPtr materialName;
    hkArray<hkMeshTexture *> textures;
};
class hkMemoryMeshShape : public hkMeshShape
{
public:
    virtual ~hkMemoryMeshShape();
    hkArray<struct hkMeshSectionCinfo> sections;
    hkArray<uint16> indices16;
    hkArray<uint32> indices32;
    hkStringPtr name;
};
class hkMemoryMeshTexture : public hkMeshTexture
{
public:
    virtual ~hkMemoryMeshTexture();
    hkStringPtr filename;
    hkArray<uint8> data;
    int8 format;
    bool hasMipMaps;
    int8 filterMode;
    int8 usageHint;
    int32 textureCoordChannel;
};
class hkMemoryMeshVertexBuffer : public hkMeshVertexBuffer
{
public:
    virtual ~hkMemoryMeshVertexBuffer();
    struct hkVertexFormat format;
    int32 elementOffsets;
    hkArray<uint8> memory;
    int32 vertexStride;
    bool locked;
    int32 numVertices;
    bool isBigEndian;
    bool isSharable;
};
class hkMultipleVertexBuffer : public hkMeshVertexBuffer
{
public:
    virtual ~hkMultipleVertexBuffer();
    struct hkVertexFormat vertexFormat;
    hkArray<struct hkMultipleVertexBufferLockedElement> lockedElements;
    struct hkMemoryMeshVertexBufferhkMemoryMeshVertexBuffer *lockedBuffer;
    hkArray<struct hkMultipleVertexBufferElementInfo> elementInfos;
    hkArray<struct hkMultipleVertexBufferVertexBufferInfo> vertexBufferInfos;
    int32 numVertices;
    bool isLocked;
    uint32 updateCount;
    bool writeLock;
    bool isSharable;
    bool constructionComplete;
};
class hkpBoxShape : public hkpConvexShape
{
public:
    virtual ~hkpBoxShape();
    hkVector4 halfExtents;
};
class hkpBvShape : public hkpShape
{
public:
    virtual ~hkpBvShape();
    struct hkpShapehkpShape *boundingVolumeShape;
    struct hkpSingleShapeContainer childShape;
};
class hkpCapsuleShape : public hkpConvexShape
{
public:
    virtual ~hkpCapsuleShape();
    hkVector4 vertexA;
    hkVector4 vertexB;
};
class hkpCollisionFilterList : public hkpCollisionFilter
{
public:
    virtual ~hkpCollisionFilterList();
    hkArray<hkpCollisionFilter *> collisionFilters;
};
class hkpConvexListShape : public hkpConvexShape
{
public:
    virtual ~hkpConvexListShape();
    float minDistanceToUseConvexHullForGetClosestPoints;
    hkVector4 aabbHalfExtents;
    hkVector4 aabbCenter;
    bool useCachedAabb;
    hkArray<hkpConvexShape *> childShapes;
};
class hkpConvexTransformShape : public hkpConvexTransformShapeBase
{
public:
    virtual ~hkpConvexTransformShape();
    hkTransform transform;
};
class hkpConvexTranslateShape : public hkpConvexTransformShapeBase
{
public:
    virtual ~hkpConvexTranslateShape();
    hkVector4 translation;
};
class hkpConvexVerticesConnectivity : public hkReferencedObject
{
public:
    virtual ~hkpConvexVerticesConnectivity();
    hkArray<uint16> vertexIndices;
    hkArray<uint8> numVerticesPerFace;
};
class hkpCylinderShape : public hkpConvexShape
{
public:
    virtual ~hkpCylinderShape();
    float cylRadius;
    float cylBaseRadiusFactorForHeightFieldCollisions;
    hkVector4 vertexA;
    hkVector4 vertexB;
    hkVector4 perpendicular1;
    hkVector4 perpendicular2;
};
class hkpDefaultConvexListFilter : public hkpConvexListFilter
{
public:
    virtual ~hkpDefaultConvexListFilter();
};
class hkpGroupFilter : public hkpCollisionFilter
{
public:
    virtual ~hkpGroupFilter();
    int32 nextFreeSystemGroup;
    uint32 collisionLookupTable;
    hkVector4 pad256;
};
class hkpListShape : public hkpShapeCollection
{
public:
    virtual ~hkpListShape();
    hkArray<struct hkpListShapeChildInfo> childInfo;
    uint16 flags;
    uint16 numDisabledChildren;
    hkVector4 aabbHalfExtents;
    hkVector4 aabbCenter;
    uint32 enabledChildren;
};
class hkpMoppBvTreeShape : public hkMoppBvTreeShapeBase
{
public:
    virtual ~hkpMoppBvTreeShape();
    struct hkpSingleShapeContainer child;
    int32 childSize;
};
class hkpMultiRayShape : public hkpShape
{
public:
    virtual ~hkpMultiRayShape();
    hkArray<struct hkpMultiRayShapeRay> rays;
    float rayPenetrationDistance;
};
class hkpMultiSphereShape : public hkpSphereRepShape
{
public:
    virtual ~hkpMultiSphereShape();
    int32 numSpheres;
    hkVector4 spheres;
};
class hkpNullCollisionFilter : public hkpCollisionFilter
{
public:
    virtual ~hkpNullCollisionFilter();
};
class hkpRemoveTerminalsMoppModifier : public hkReferencedObject
{
public:
    virtual ~hkpRemoveTerminalsMoppModifier();
    hkArray<uint32> removeInfo;
    void *tempShapesToRemove;
};
class hkpShapeInfo : public hkReferencedObject
{
public:
    virtual ~hkpShapeInfo();
    struct hkpShapehkpShape *shape;
    bool isHierarchicalCompound;
    bool hkdShapesCollected;
    hkArray<hkStringPtr> childShapeNames;
    hkArray<hkTransform> childTransforms;
    hkTransform transform;
};
class hkpSingleShapeContainer : public hkpShapeContainer
{
public:
    virtual ~hkpSingleShapeContainer();
    struct hkpShapehkpShape *childShape;
};
class hkpSphereShape : public hkpConvexShape
{
public:
    virtual ~hkpSphereShape();
    uint32 pad16;
};
class hkpTransformShape : public hkpShape
{
public:
    virtual ~hkpTransformShape();
    struct hkpSingleShapeContainer childShape;
    int32 childShapeSize;
    hkQuaternion rotation;
    hkTransform transform;
};
class hkpTriangleShape : public hkpConvexShape
{
public:
    virtual ~hkpTriangleShape();
    uint16 weldingInfo;
    uint8 weldingType;
    uint8 isExtruded;
    hkVector4 vertexA;
    hkVector4 vertexB;
    hkVector4 vertexC;
    hkVector4 extrusion;
};
class hkpCompressedMeshShape : public hkpShapeCollection
{
public:
    virtual ~hkpCompressedMeshShape();
    int32 bitsPerIndex;
    int32 bitsPerWIndex;
    int32 wIndexMask;
    int32 indexMask;
    float radius;
    uint8 weldingType;
    uint8 materialType;
    hkArray<uint32> materials;
    hkArray<uint16> materials16;
    hkArray<uint8> materials8;
    hkArray<hkQsTransform> transforms;
    hkArray<hkVector4> bigVertices;
    hkArray<struct hkpCompressedMeshShapeBigTriangle> bigTriangles;
    hkArray<struct hkpCompressedMeshShapeChunk> chunks;
    hkArray<struct hkpCompressedMeshShapeConvexPiece> convexPieces;
    float error;
    struct hkAabb bounds;
    uint32 defaultCollisionFilterInfo;
    void *meshMaterials;
    uint16 materialStriding;
    uint16 numMaterials;
    hkArray<struct hkpNamedMeshMaterial> namedMaterials;
};
class hkpConvexVerticesShape : public hkpConvexShape
{
public:
    virtual ~hkpConvexVerticesShape();
    hkVector4 aabbHalfExtents;
    hkVector4 aabbCenter;
    hkArray<struct hkpConvexVerticesShapeFourVectors> rotatedVertices;
    int32 numVertices;
    void *externalObject;
    void *getFaceNormals;
    hkArray<hkVector4> planeEquations;
    struct hkpConvexVerticesConnectivityhkpConvexVerticesConnectivity *connectivity;
};
class hkpConvexPieceMeshShape : public hkpShapeCollection
{
public:
    virtual ~hkpConvexPieceMeshShape();
    struct hkpConvexPieceStreamDatahkpConvexPieceStreamData *convexPieceStream;
    struct hkpShapeCollectionhkpShapeCollection *displayMesh;
    float radius;
};
class hkpExtendedMeshShape : public hkpShapeCollection
{
public:
    virtual ~hkpExtendedMeshShape();
    struct hkpExtendedMeshShapeTrianglesSubpart embeddedTrianglesSubpart;
    hkVector4 aabbHalfExtents;
    hkVector4 aabbCenter;
    void *materialClass;
    int32 numBitsForSubpartIndex;
    hkArray<struct hkpExtendedMeshShapeTrianglesSubpart> trianglesSubparts;
    hkArray<struct hkpExtendedMeshShapeShapesSubpart> shapesSubparts;
    hkArray<uint16> weldingInfo;
    uint8 weldingType;
    uint32 defaultCollisionFilterInfo;
    int32 cachedNumChildShapes;
    float triangleRadius;
    int32 padding;
};
class hkpStorageExtendedMeshShape : public hkpExtendedMeshShape
{
public:
    virtual ~hkpStorageExtendedMeshShape();
    hkArray<hkpStorageExtendedMeshShapeMeshSubpartStorage *> meshstorage;
    hkArray<hkpStorageExtendedMeshShapeShapeSubpartStorage *> shapestorage;
};
class hkpStorageExtendedMeshShapeMeshSubpartStorage : public hkReferencedObject
{
public:
    virtual ~hkpStorageExtendedMeshShapeMeshSubpartStorage();
    hkArray<hkVector4> vertices;
    hkArray<uint8> indices8;
    hkArray<uint16> indices16;
    hkArray<uint32> indices32;
    hkArray<uint8> materialIndices;
    hkArray<struct hkpStorageExtendedMeshShapeMaterial> materials;
    hkArray<struct hkpNamedMeshMaterial> namedMaterials;
    hkArray<uint16> materialIndices16;
};
class hkpStorageExtendedMeshShapeShapeSubpartStorage : public hkReferencedObject
{
public:
    virtual ~hkpStorageExtendedMeshShapeShapeSubpartStorage();
    hkArray<uint8> materialIndices;
    hkArray<struct hkpStorageExtendedMeshShapeMaterial> materials;
    hkArray<uint16> materialIndices16;
};
class hkpCompressedSampledHeightFieldShape : public hkpSampledHeightFieldShape
{
public:
    virtual ~hkpCompressedSampledHeightFieldShape();
    hkArray<uint16> storage;
    bool triangleFlip;
    float offset;
    float scale;
};
class hkpPlaneShape : public hkpHeightFieldShape
{
public:
    virtual ~hkpPlaneShape();
    hkVector4 plane;
    hkVector4 aabbCenter;
    hkVector4 aabbHalfExtents;
};
class hkpStorageSampledHeightFieldShape : public hkpSampledHeightFieldShape
{
public:
    virtual ~hkpStorageSampledHeightFieldShape();
    hkArray<float> storage;
    bool triangleFlip;
};
class hkpTriSampledHeightFieldBvTreeShape : public hkpBvTreeShape
{
public:
    virtual ~hkpTriSampledHeightFieldBvTreeShape();
    struct hkpSingleShapeContainer childContainer;
    int32 childSize;
    bool wantAabbRejectionTest;
    uint8 padding;
};
class hkpTriSampledHeightFieldCollection : public hkpShapeCollection
{
public:
    virtual ~hkpTriSampledHeightFieldCollection();
    struct hkpSampledHeightFieldShapehkpSampledHeightFieldShape *heightfield;
    int32 childSize;
    float radius;
    hkArray<uint16> weldingInfo;
    hkVector4 triangleExtrusion;
};
class hkpFastMeshShape : public hkpMeshShape
{
public:
    virtual ~hkpFastMeshShape();
};
class hkpMeshShape : public hkpShapeCollection
{
public:
    virtual ~hkpMeshShape();
    hkVector4 scaling;
    int32 numBitsForSubpartIndex;
    hkArray<struct hkpMeshShapeSubpart> subparts;
    hkArray<uint16> weldingInfo;
    uint8 weldingType;
    float radius;
    int32 pad;
};
class hkpStorageMeshShape : public hkpMeshShape
{
public:
    virtual ~hkpStorageMeshShape();
    hkArray<hkpStorageMeshShapeSubpartStorage *> storage;
};
class hkpStorageMeshShapeSubpartStorage : public hkReferencedObject
{
public:
    virtual ~hkpStorageMeshShapeSubpartStorage();
    hkArray<float> vertices;
    hkArray<uint16> indices16;
    hkArray<uint32> indices32;
    hkArray<uint8> materialIndices;
    hkArray<uint32> materials;
    hkArray<uint16> materialIndices16;
};
class hkpSimpleMeshShape : public hkpShapeCollection
{
public:
    virtual ~hkpSimpleMeshShape();
    hkArray<hkVector4> vertices;
    hkArray<struct hkpSimpleMeshShapeTriangle> triangles;
    hkArray<uint8> materialIndices;
    float radius;
    uint8 weldingType;
};
class hkpAabbPhantom : public hkpPhantom
{
public:
    virtual ~hkpAabbPhantom();
    struct hkAabb aabb;
    hkArray<hkpCollidable *> overlappingCollidables;
    bool orderDirty;
};
class hkpBallAndSocketConstraintData : public hkpConstraintData
{
public:
    virtual ~hkpBallAndSocketConstraintData();
    struct hkpBallAndSocketConstraintDataAtoms atoms;
};
class hkpBallSocketChainData : public hkpConstraintChainData
{
public:
    virtual ~hkpBallSocketChainData();
    struct hkpBridgeAtoms atoms;
    hkArray<struct hkpBallSocketChainDataConstraintInfo> infos;
    float tau;
    float damping;
    float cfm;
    float maxErrorDistance;
};
class hkpBoxMotion : public hkpMotion
{
public:
    virtual ~hkpBoxMotion();
};
class hkpBreakableConstraintData : public hkpConstraintData
{
public:
    virtual ~hkpBreakableConstraintData();
    struct hkpBridgeAtoms atoms;
    struct hkpConstraintDatahkpConstraintData *constraintData;
    uint16 childRuntimeSize;
    uint16 childNumSolverResults;
    float solverResultLimit;
    bool removeWhenBroken;
    bool revertBackVelocityOnBreak;
};
class hkpCachingShapePhantom : public hkpShapePhantom
{
public:
    virtual ~hkpCachingShapePhantom();
    hkArray<void> collisionDetails;
    bool orderDirty;
};
class hkpCallbackConstraintMotor : public hkpLimitedForceConstraintMotor
{
public:
    virtual ~hkpCallbackConstraintMotor();
    void *callbackFunc;
    uint32 callbackType;
    uint64 userData0;
    uint64 userData1;
    uint64 userData2;
};
class hkpCharacterMotion : public hkpMotion
{
public:
    virtual ~hkpCharacterMotion();
};
class hkpCogWheelConstraintData : public hkpConstraintData
{
public:
    virtual ~hkpCogWheelConstraintData();
    struct hkpCogWheelConstraintDataAtoms atoms;
};
class hkpConstraintChainInstance : public hkpConstraintInstance
{
public:
    virtual ~hkpConstraintChainInstance();
    hkArray<hkpEntity *> chainedEntities;
    struct hkpConstraintChainInstanceActionhkpConstraintChainInstanceAction *action;
};
class hkpConstraintChainInstanceAction : public hkpAction
{
public:
    virtual ~hkpConstraintChainInstanceAction();
    struct hkpConstraintChainInstancehkpConstraintChainInstance *constraintInstance;
};
class hkpConstraintCollisionFilter : public hkpPairCollisionFilter
{
public:
    virtual ~hkpConstraintCollisionFilter();
};
class hkpConstraintInstance : public hkReferencedObject
{
public:
    virtual ~hkpConstraintInstance();
    void *owner;
    struct hkpConstraintDatahkpConstraintData *data;
    struct hkpModifierConstraintAtomhkpModifierConstraintAtom *constraintModifiers;
    struct hkpEntityhkpEntity *entities;
    uint8 priority;
    bool wantRuntime;
    uint8 destructionRemapInfo;
    struct hkpConstraintInstanceSmallArraySerializeOverrideType listeners;
    hkStringPtr name;
    uint64 userData;
    void *internal;
    uint32 uid;
};
class hkpDefaultWorldMemoryWatchDog : public hkWorldMemoryAvailableWatchDog
{
public:
    virtual ~hkpDefaultWorldMemoryWatchDog();
    int32 freeHeapMemoryRequested;
};
class hkpEntity : public hkpWorldObject
{
public:
    virtual ~hkpEntity();
    struct hkpMaterial material;
    void *limitContactImpulseUtilAndFlag;
    float damageMultiplier;
    void *breakableBody;
    uint32 solverData;
    uint16 storageIndex;
    uint16 contactPointCallbackDelay;
    struct hkpEntitySmallArraySerializeOverrideType constraintsMaster;
    hkArray<hkpConstraintInstance *> constraintsSlave;
    hkArray<uint8> constraintRuntime;
    void *simulationIsland;
    int8 autoRemoveLevel;
    uint8 numShapeKeysInContactPointProperties;
    uint8 responseModifierFlags;
    uint32 uid;
    struct hkpEntitySpuCollisionCallback spuCollisionCallback;
    struct hkpMaxSizeMotion motion;
    struct hkpEntitySmallArraySerializeOverrideType contactListeners;
    struct hkpEntitySmallArraySerializeOverrideType actions;
    struct hkLocalFramehkLocalFrame *localFrame;
    struct hkpEntityExtendedListenershkpEntityExtendedListeners *extendedListeners;
    uint32 npData;
};
class hkpFixedRigidMotion : public hkpKeyframedRigidMotion
{
public:
    virtual ~hkpFixedRigidMotion();
};
class hkpGenericConstraintData : public hkpConstraintData
{
public:
    virtual ~hkpGenericConstraintData();
    struct hkpBridgeAtoms atoms;
    struct hkpGenericConstraintDataScheme scheme;
};
class hkpHingeConstraintData : public hkpConstraintData
{
public:
    virtual ~hkpHingeConstraintData();
    struct hkpHingeConstraintDataAtoms atoms;
};
class hkpHingeLimitsData : public hkpConstraintData
{
public:
    virtual ~hkpHingeLimitsData();
    struct hkpHingeLimitsDataAtoms atoms;
};
class hkpKeyframedRigidMotion : public hkpMotion
{
public:
    virtual ~hkpKeyframedRigidMotion();
};
class hkpLimitedHingeConstraintData : public hkpConstraintData
{
public:
    virtual ~hkpLimitedHingeConstraintData();
    struct hkpLimitedHingeConstraintDataAtoms atoms;
};
class hkpLinearParametricCurve : public hkpParametricCurve
{
public:
    virtual ~hkpLinearParametricCurve();
    float smoothingFactor;
    bool closedLoop;
    hkVector4 dirNotParallelToTangentAlongWholePath;
    hkArray<hkVector4> points;
    hkArray<float> distance;
};
class hkpMalleableConstraintData : public hkpConstraintData
{
public:
    virtual ~hkpMalleableConstraintData();
    struct hkpConstraintDatahkpConstraintData *constraintData;
    struct hkpBridgeAtoms atoms;
    float strength;
};
class hkpMaxSizeMotion : public hkpKeyframedRigidMotion
{
public:
    virtual ~hkpMaxSizeMotion();
};
class hkpPairCollisionFilter : public hkpCollisionFilter
{
public:
    virtual ~hkpPairCollisionFilter();
    struct hkpPairCollisionFilterMapPairFilterKeyOverrideType disabledPairs;
    struct hkpCollisionFilterhkpCollisionFilter *childFilter;
};
class hkpPhysicsSystem : public hkReferencedObject
{
public:
    virtual ~hkpPhysicsSystem();
    hkArray<hkpRigidBody *> rigidBodies;
    hkArray<hkpConstraintInstance *> constraints;
    hkArray<hkpAction *> actions;
    hkArray<hkpPhantom *> phantoms;
    hkStringPtr name;
    uint64 userData;
    bool active;
};
class hkpPointToPathConstraintData : public hkpConstraintData
{
public:
    virtual ~hkpPointToPathConstraintData();
    struct hkpBridgeAtoms atoms;
    struct hkpParametricCurvehkpParametricCurve *path;
    float maxFrictionForce;
    int8 angularConstrainedDOF;
    hkTransform transform_OS_KS;
};
class hkpPointToPlaneConstraintData : public hkpConstraintData
{
public:
    virtual ~hkpPointToPlaneConstraintData();
    struct hkpPointToPlaneConstraintDataAtoms atoms;
};
class hkpPositionConstraintMotor : public hkpLimitedForceConstraintMotor
{
public:
    virtual ~hkpPositionConstraintMotor();
    float tau;
    float damping;
    float proportionalRecoveryVelocity;
    float constantRecoveryVelocity;
};
class hkpPrismaticConstraintData : public hkpConstraintData
{
public:
    virtual ~hkpPrismaticConstraintData();
    struct hkpPrismaticConstraintDataAtoms atoms;
};
class hkpPulleyConstraintData : public hkpConstraintData
{
public:
    virtual ~hkpPulleyConstraintData();
    struct hkpPulleyConstraintDataAtoms atoms;
};
class hkpRackAndPinionConstraintData : public hkpConstraintData
{
public:
    virtual ~hkpRackAndPinionConstraintData();
    struct hkpRackAndPinionConstraintDataAtoms atoms;
};
class hkpRagdollConstraintData : public hkpConstraintData
{
public:
    virtual ~hkpRagdollConstraintData();
    struct hkpRagdollConstraintDataAtoms atoms;
};
class hkpRagdollLimitsData : public hkpConstraintData
{
public:
    virtual ~hkpRagdollLimitsData();
    struct hkpRagdollLimitsDataAtoms atoms;
};
class hkpRigidBody : public hkpEntity
{
public:
    virtual ~hkpRigidBody();
};
class hkpRotationalConstraintData : public hkpConstraintData
{
public:
    virtual ~hkpRotationalConstraintData();
    struct hkpRotationalConstraintDataAtoms atoms;
};
class hkpSimpleShapePhantom : public hkpShapePhantom
{
public:
    virtual ~hkpSimpleShapePhantom();
    hkArray<struct hkpSimpleShapePhantomCollisionDetail> collisionDetails;
    bool orderDirty;
};
class hkpSimulation : public hkReferencedObject
{
public:
    virtual ~hkpSimulation();
    uint32 determinismCheckFrameCounter;
    struct hkpWorldhkpWorld *world;
    uint8 lastProcessingStep;
    float currentTime;
    float currentPsiTime;
    float physicsDeltaTime;
    float simulateUntilTime;
    float frameMarkerPsiSnap;
    uint32 previousStepResult;
};
class hkpSphereMotion : public hkpMotion
{
public:
    virtual ~hkpSphereMotion();
};
class hkpSpringDamperConstraintMotor : public hkpLimitedForceConstraintMotor
{
public:
    virtual ~hkpSpringDamperConstraintMotor();
    float springConstant;
    float springDamping;
};
class hkpStiffSpringChainData : public hkpConstraintChainData
{
public:
    virtual ~hkpStiffSpringChainData();
    struct hkpBridgeAtoms atoms;
    hkArray<struct hkpStiffSpringChainDataConstraintInfo> infos;
    float tau;
    float damping;
    float cfm;
};
class hkpStiffSpringConstraintData : public hkpConstraintData
{
public:
    virtual ~hkpStiffSpringConstraintData();
    struct hkpStiffSpringConstraintDataAtoms atoms;
};
class hkpThinBoxMotion : public hkpBoxMotion
{
public:
    virtual ~hkpThinBoxMotion();
};
class hkpVelocityConstraintMotor : public hkpLimitedForceConstraintMotor
{
public:
    virtual ~hkpVelocityConstraintMotor();
    float tau;
    float velocityTarget;
    bool useVelocityTargetFromConstraintTargets;
};
class hkpWheelConstraintData : public hkpConstraintData
{
public:
    virtual ~hkpWheelConstraintData();
    struct hkpWheelConstraintDataAtoms atoms;
    hkVector4 initialAxleInB;
    hkVector4 initialSteeringAxisInB;
};

struct hkpConstraintInfo
{
    int32 maxSizeOfSchema;    // 00
    int32 sizeOfSchemas;      // 04
    int32 numSolverResults;   // 08
    int32 numSolverElemTemps; // 0C
};

class hkpConstraintOwner : public hkReferencedObject
{
public:
    hkpConstraintInfo constraintInfo; // 10
};

struct hkpAgentNnSector
{
    uint8 data[960];
};

struct hkpAgentNnTrack
{
public:
    // members
    uint16 bytesUsedInLastSector;                  // 00
    uint8 nnTrackType;                             // 02
    uint8 padding;                                 // 03
    uint32 pad04;                                  // 04
    hkInplaceArray<hkpAgentNnSector *, 1> sectors; // 08
};

class hkpSimulationIsland : public hkpConstraintOwner
{
public:
    hkpWorld *world;              // 20
    int32 numConstraints;         // 28
    uint16 storageIndex;          // 2C
    uint16 dirtyListIndex;        // 2E
    uint8 splitCheckFrameCounter; // 30

    bool splitCheckRequested : 2;         // 31 - 0
    bool isSparse : 2;                    // 31 - 2
    bool actionListCleanupNeeded : 2;     // 31 - 4
    bool allowIslandLocking : 2;          // 31 - 6
    bool isInActiveIslandsArray : 2;      // 32 - 0
    bool activeMark : 2;                  // 32 - 2
    bool tryToIncreaseIslandSizeMark : 2; // 32 - 4
    bool inIntegrateJob : 2;              // 32 - 6

    uint8 pad33;                                 // 33
    mutable hkMultiThreadCheck multiThreadCheck; // 34
    float timeSinceLastHighFrequencyCheck;       // 40
    float timeSinceLastLowFrequencyCheck;        // 44
    hkArray<hkpAction *> actions;                // 48
    float timeOfDeactivation;                    // 58
    uint32 pad5C;                                // 5C
    hkInplaceArray<hkpEntity *, 1> entities;     // 60
    hkpAgentNnTrack midphaseAgentTrack;          // 78
    hkpAgentNnTrack narrowphaseAgentTrack;       // 98
};

class hkpWorld : public hkReferencedObject
{
public:
    virtual ~hkpWorld();
    struct hkpSimulationhkpSimulation *simulation;
    hkVector4 gravity;
    void *fixedIsland;
    struct hkpRigidBodyhkpRigidBody *fixedRigidBody;
    hkArray<hkpSimulationIsland *> activeSimulationIslands;
    hkArray<hkpSimulationIsland *> inactiveSimulationIslands;
    hkArray<hkpSimulationIsland *> dirtySimulationIslands;
    void *maintenanceMgr;
    void *memoryWatchDog;
    bool assertOnRunningOutOfSolverMemory;
    void *broadPhase;
    void *kdTreeManager;
    bool autoUpdateTree;
    void *broadPhaseDispatcher;
    void *phantomBroadPhaseListener;
    void *entityEntityBroadPhaseListener;
    void *broadPhaseBorderListener;
    void *multithreadedSimulationJobData;
    void *collisionInput;
    void *collisionFilter;
    void *collisionDispatcher;
    void *convexListFilter;
    void *pendingOperations;
    int32 pendingOperationsCount;
